import React from "react";

const Home = () => {
    return (
        <div
            style={{
                maxWidth: "780px",
            }}
        >
            <h1
                style={{
                    textAlign: "center",
                    marginTop: "50px",
                }}
            >
                Добро пожаловать на страницу проекта по JavaScript c
                использованием фреймворма React!
            </h1>
            <p
                style={{
                    marginTop: "50px",
                    fontSize: "20px",
                }}
            >
                Это приложение предоставляет удобный и быстрый доступ к списку
                пользователей. На странице вывода списка пользователей вы
                сможете просмотреть данные всех пользователей и групп, к которым
                они относятся. Также есть возможность добавлять новых
                пользователей.
                <br />
                <br />
                Есть несколько вариантов отображения данных, такие как общая
                таблица и список карточек пользователей. Приложение загружает
                данные, предоставляемые https://dummyjson.com, в формате JSON с
                сервера.
                <br />
                <br />
                Все списки могут быть отсортированы по нужному полю и имеют
                возможность поиска по имени. Надеюсь, что мое приложение поможет
                вам быстро находить нужную информацию о пользователях.
                <br />
                <br />
                <i>Рекомендуется ознакомиться с документацией!</i>
            </p>
        </div>
    );
};

export default Home;
